Luminos-Tech/luminostech-lumohub/Lumo/Lumo-LuminosTech/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# ── Bluetooth (ESP32-C3 band scanning) ──────────────────────────
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1

# ── TLS ─────────────────────────────────────────────────────────
# Lock CRT bundle ON: all HTTPS calls use the ESP-IDF root CA store.
# This replaces the (wrong-domain) embedded server_cert.pem that was
# previously dead code — it did not match lumohub.luminostech.tech.
CONFIG_ESP_TLS_USE_CERT_BUNDLE=y
